{
    "nome": "Especialista em Desenvolvimento de Software - Ministério da Economia",
    "tags": "lógica, programação, desenvolvimento, algoritmo",
    "data": "2020",
    "questoes": {
      "questao1": {
        "texto": "Texto <b>CG1A1-I</b> <br><br>Algumas das primeiras incursões pelos mundos paralelos ocorreram na década de 50 do século passado, graças ao trabalho de pesquisadores interessados em certos aspectos da mecânica quântica — teoria desenvolvida para explicar os fenômenos que         ocorrem no reino microscópico dos átomos e das partículas subatômicas. A mecânica quântica quebrou o molde da mecânica clássica, que a antecedeu, ao firmar o conceito de que as previsões científicas são necessariamente probabilísticas. Podemos prever a probabilidade de alcançar determinado resultado ou outro, mas em geral não podemos prever qual deles acontecerá. Essa quebra de rumo com relação a centenas de anos de pensamento científico já é suficientemente chocante, mas há outro aspecto da teoria quântica que nos confunde ainda mais, embora desperte menos atenção. Depois de anos de criterioso estudo da mecânica quântica, e depois da acumulação de uma pletora de dados que confirmam suas previsões probabilísticas, ninguém até hoje soube explicar por que razão apenas uma das muitas resoluções possíveis de qualquer situação que se estude torna-se real. Quando fazemos experimentos, quando examinamos o mundo, todos estamos de acordo com o fato de que deparamos com uma realidade única e definida. Contudo, mais de um século depois do início da revolução quântica, não há consenso entre os físicos quanto à razão e à forma de compatibilizar esse fato básico com a expressão matemática da teoria. <br><br>Acerca das ideias e dos sentidos do texto CG1A1-I, julgue os próximos itens. <br><br> <b>1</b> De acordo com o texto, um aspecto da teoria quântica que recebeu menor atenção é a singularidade do real confrontada com a infinitude de possibilidades especuladas.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao2": {
        "texto": "<b>2</b> No primeiro período do texto, a locução “graças ao” introduz o resultado das incursões pelos mundos paralelos na década de 50 do século passado.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao3": {
        "texto": "<b>3</b> Infere-se da afirmação “A mecânica quântica quebrou o molde da mecânica clássica”, no segundo período do texto, que a mecânica quântica subverteu paradigmas da mecânica clássica.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao4": {
        "texto": "<b>4</b> De acordo com o texto, apesar de a mecânica quântica já ter estabelecido teoricamente o caráter probabilístico dos cálculos científicos, ainda há controvérsias acerca da tradução desse princípio em termos matemáticos.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao5": {
        "texto": "<b>5</b> No terceiro período do texto, o adjetivo “determinado” está empregado com o mesmo sentido de <b>decidido</b>.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao6": {
        "texto": "Com relação aos aspectos linguísticos do texto CG1A1-I, julgue os itens a seguir. <br><br><b>6</b> No segundo período do texto, o termo “a”, em “que a antecedeu”, faz referência a “mecânica quântica”.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao7": {
        "texto": "<b>7</b> No quinto período do texto, o vocábulo “suas”, em “suas previsões”, tem como referente o termo “pletora”.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao8": {
        "texto": "<b>8</b> No quarto período do texto, a substituição de “embora desperte” por <b>apesar de despertar</b> manteria a correção gramatical e o sentido original do texto.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao9": {
        "texto": "<b>9</b> No trecho “com relação a centenas de anos de pensamento científico”, no quarto período do texto, a substituição do vocábulo “a” por às manteria a correção gramatical do texto.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao10": {
        "texto": "<b>10</b> Mantendo-se a correção gramatical e a coerência do texto, o trecho “Depois de anos de criterioso estudo da mecânica quântica, e depois da acumulação de uma pletora de dados que confirmam suas previsões probabilísticas”, no quinto período do texto, poderia ser reescrito da seguinte maneira: Após anos de meticuloso estudo da mecânica quântica, e após a acumulação de uma superabundância de dados que confirmam suas previsões probabilísticas.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao11": {
        "texto": "<b>11</b> No trecho “por que razão”, no quinto período, o vocábulo “que” poderia ser substituído por <b>qual</b>, sem prejuízo da correção gramatical do texto.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao12": {
        "texto": "<b>12</b> No quinto período do texto, a forma verbal “estude” expressa uma exigência.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao13": {
        "texto": "<b>13</b> No trecho “deparamos com uma realidade única e definida”, no sexto período do texto, a supressão da preposição “com” prejudicaria a correção gramatical do texto.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao14": {
        "texto": "Ele entrou tarde no restaurante. Poderia ter uns sessenta anos, era alto, corpulento, de cabelos brancos, sobrancelhas espessas e mãos potentes. Num dedo o anel de sua força. Sentou-se amplo e sólido.<br> Perdi-o de vista e enquanto comia observei de novo amulher magra de chapéu. Ela ria com a boca cheia e rebrilhava osolhos escuros.<br> No momento em que eu levava o garfo à boca, olhei-o. Ei-lo de olhos fechados mastigando pão com vigor e mecanismo, os dois punhos cerrados sobre a mesa. Continuei comendo e olhando. O garçom dispunha os pratos sobre a toalha. Mas ovelho mantinha os olhos fechados. A um gesto mais vivo do criado ele os abriu com tal brusquidão que este mesmo  movimento se comunicou às grandes mãos e um garfo caiu. O garçom sussurrou palavras amáveis abaixando-se para apanhá-lo; ele não respondia. Porque agora desperto, virava subitamente a carne de um lado e de outro, examinava-a com veemência, a ponta da língua aparecendo — apalpava o bife com as costas do garfo, quase o cheirava, mexendo a boca de antemão. E começava a cortá-lo com um movimento inútil devigor de todo o corpo. Olhei para o meu prato. Quando fitei-o de novo, ele estava em plena glória do jantar, mastigando de boca aberta, passando a língua pelos dentes, com o olhar fixo na luz do teto.<br><br>Julgue os itens que se seguem, relativos às ideias e aos aspectos linguísticos do texto precedente.<br><br><b>14</b> O texto narra, de forma breve, o comportamento de um homem durante um jantar.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao15": {
        "texto": "<b>15</b> No trecho “Porque agora desperto, virava subitamente a carne de um lado e de outro”, no terceiro parágrafo, o vocábulo “porque”, introduz, no período em que se insere, uma ideia de finalidade.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao16": {
        "texto": "<b>16</b> No trecho “No momento em que eu levava o garfo à boca”, no terceiro parágrafo, o sinal indicativo de crase empregado em “à” poderia ser suprimido, sem prejuízo para a correção gramatical do trecho.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao17": {
        "texto": "<b>17</b> No trecho apresentado o narrador condena os modos do homem que ele observa jantar, modos esses que deixa clara a diferença de classe social entre eles.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao18": {
        "texto": "<b>18</b> No oitavo período do terceiro parágrafo do texto, a forma pronominal “lo”, em “cortá-lo”, refere-se ao vocábulo “bife”, no período anterior.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao19": {
        "texto": "Quando eu era criança (e isso aconteceu em outro tempo e em outro espaço), não era incomum ouvir a pergunta “Quão longe é daqui até lá?” respondida por um “Mais ou menos uma hora, ou um pouco menos se você caminhar rápido”. Num tempo ainda anterior à minha infância, suponho que a resposta mais comum teria sido “Se você sair agora, estará lá por volta do meio-dia” ou “Melhor sair agora, se você quiser chegar antes que escureça”. Hoje em dia, pode-se ouvir ocasionalmente essas respostas. Mas serão normalmente precedidas por uma solicitação para ser mais específico: “Você vai de carro ou a pé?”.<br>“Longe” e “tarde”, assim como “perto” e “cedo” , significavam quase a mesma coisa: exatamente quanto esforço seria necessário para que um ser humano percorresse uma certa distância — fosse caminhando, semeando ou arando. Se as pessoas fossem instadas a explicar o que entendiam por “espaço” e “tempo”, poderiam ter dito que “espaço” é o que se podepercorrer em certo tempo, e que “tempo” é o que se precisa para percorrê-lo. Se não fossem muito pressionados, porém, não entrariam no jogo da definição. E por que deveriam? A maioria das coisas que fazem parte da vida cotidiana são compreendidas razoavelmente até que se precise defini-las; e, a menos que solicitados, não precisaríamos defini-las. O modo como compreendíamos essas coisas que hoje tendemos a chamar de “espaço” e “tempo” era não apenas satisfatório, mas tão preciso quanto necessário, pois era o wetware — os humanos, os bois e os cavalos — que fazia o esforço e punha os limites. Um par de pernas humanas pode ser diferente de outros, mas a substituição de um par por outro não faria uma diferença suficientemente grande para requerer outras medidas além da capacidade dos músculos humanos.<br><br>A respeito das ideias e dos aspectos linguísticos do texto anterior, julgue os itens seguintes.<br><br><b>19</b> Para o autor, a maneira como tempo e espaço eram percebidos antigamente é diferente daquela notada por ele quando do seu relato.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao20": {
        "texto": "<b>20</b> A correção gramatical e o sentido original do texto seriam preservados se o período “Se não fossem muito pressionados, porém, não entrariam no jogo da definição”, no segundo parágrafo, fosse reescrito da seguinte forma: Não entrariam no jogo da definição se não fossem muito pressionados, porém.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao21": {
        "texto": "<b>21</b> A vírgula empregada logo após o trecho “Num tempo ainda anterior à minha infância”, no primeiro parágrafo do texto, poderia ser suprimida sem prejuízo para a correção gramatical do texto.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao22": {
        "texto": "<b>22</b> No primeiro parágrafo do texto, os trechos ‘Se você sair agora’ e ‘Melhor sair agora’ exprimem, respectivamente, a consequência do evento expresso pelo trecho ‘estará lá por volta do meio-dia’ e o resultado do que é expresso pelo trecho ‘se você quiser chegar antes que escureça’.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao23": {
        "texto": "<b>23</b> No trecho “pois era o wetware — os humanos, os bois e os cavalos — que fazia o esforço e punha os limites”, no segundo parágrafo do texto, o verbo fazia está flexionado no singular porque concorda com o termo “wetware”.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao24": {
        "texto": "<b>24</b> A próclise observada em “se pode percorrer” e “se precisa”, no segundo período do segundo parágrafo do texto, é opcional, de modo que o emprego da ênclise nesses dois casos também seria correto: pode-se percorrer e precisa-se, respectivamente.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao25": {
        "texto": "<b>25</b> No trecho “Um par de pernas humanas pode ser diferente de outros, mas a substituição de um par por outro não faria uma diferença suficientemente grande para requerer outras medidas além da capacidade dos músculos humanos”, no último período do texto, a substituição de “mas” por entretanto manteria a correção gramatical e a coerência do texto.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao26": {
        "texto": "As a young democracy, Brazil has confronted economic and financial upheavals in the past. The country’s economic crisis of 2014—2017 saw a drastic fall in gross domestic product (GDP), stark rise in unemployment, a severe fiscal crisis, and an increased budget deficit. Since then, the economy has been a prominent issue in political conversations, especially regarding globalization and the ways in which trade liberalization can affect economic growth. Those running for office in 2018 differed slightly in this debate, and comparing the proposals and backgrounds of their economic advisors was as important as comparing the candidates themselves.<br><br>Considering the text above, judge the following items.<br><br><b>26</b>According to the text, Brazil has a long history of democracy.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao27": {
        "texto": "<b>27</b> The authors of the text state that, in the past, Brazil faced economic challenges.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao28": {
        "texto": "<b>28</b> The adverb “then” (third sentence) substitutes the antecedent “The country’s economic crisis of 2014—2017” (second sentence).",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao29": {
        "texto": "<b>29</b> In “especially regarding globalization and the ways in which trade liberalization can affect economic growth” (third sentence), the word “growth” can be substituted by the word <b>expansion</b> without substantially changing the meaning of the sentence.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao30": {
        "texto": "<b>30</b> The authors of the text argue that during the 2018 election it was important for voters to learn about political candidates’ economic advisors.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao31": {
        "texto": "Despite being the eighth largest economy in the world and the largest in Latin America, Brazil is still relatively closed compared to other large economies. Brazil is an outlier in that its trade penetration is extremely low, with trade at 24.1 percent of GDP in 2017. The number of exporters relative to the population is also very small: its absolute number of exporters is roughly the same as that of Norway, a country with approximately 5 million people compared to Brazil’s 200 million. While further integrating into the global economy could threaten uncompetitive companies and their workers, competitive businesses would most likely benefit. Brazil’s insertion would also allow the country to better leverage its competitive advantages, such as in natural resource-based industries.<br><br>Judge the following items, based on the text above.<br><br><b>31</b>According to the text, at the time of publication, there were eight countries with economies larger than Brazil’s.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao32": {
        "texto": "<b>32</b> The authors present data that demonstrates that, when the text was written, Brazil participated in international commerce at the same level as other countries with robust economies.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao33": {
        "texto": "<b>33</b> The text cites Norway as an example of a country with a similar number of exporters and total population as Brazil.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao34": {
        "texto": "<b>34</b> The authors claim that if Brazil expands its international commerce activities, this will only put weak local businesses and their workers at risk.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao35": {
        "texto": "<b>35</b> “Brazil” is the antecedent of the pronoun “its” in “its absolute number of exporters” (third sentence)",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao36": {
        "texto": "With the exception of business owners and investors, most Brazilians looked for candidates who prioritized job creation and income generation, in the 2018 elections. According to a Brazilian Economic Outlook from the Institute of Applied Economic Research (IPEA), the economy sustained growth (albeit slow) for a while since the end of 2017, industrial production increased, and unemployment rates declined. Nevertheless, 13.4 million people remained jobless, particularly women, youth, and people of color; and growth rates were disappointing. A poll by Datafolha showed at the time that Brazilians’ perceptions of the economy were pessimistic: 72 percent of those surveyed felt the economic scenario had worsened in the last months. Similar to the reaction to corruption, this extremely negative perception of the socioeconomic environment could potentially further distance voters from the traditional government and their allies, turning voters toward “unconventional” candidates instead, who could represent a change in the status quo.<br><br>Concerning the text presented above, judge the following items.<br><br><b>36</b>It can be concluded from the text that job creation was a priority for many Brazilian voters, in 2018.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao37": {
        "texto": "<b>37</b> When the article was published, unemployment rates in Brazil had been going down.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao38": {
        "texto": "<b>38</b> According to the authors, unemployment in Brazil, at the time of publication, affected all gender and racial profiles equally.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao39": {
        "texto": "<b>39</b> The article presents data from a survey that pointed to optimism about Brazil’s economic situation.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao40": {
        "texto": "<b>40</b> The authors claim that voters’ attitudes towards the economic situation at the time would lead to them identifying with candidates from traditional political parties.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao41": {
        "texto": "Considere que as seguintes proposições sejam verdadeiras.<br><br>• P: “Se o processo foi relatado e foi assinado, então ele foi discutido em reunião”.<br> • Q: “Se o processo não foi relatado, então ele não foi assinado”.<br><br>Com base nessas informações, julgue os itens a seguir.<br><br><b>41</b> A proposição “Se o processo não foi discutido em reunião, então ele não foi assinado” é verdadeira.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao42": {
        "texto": "<b>42</b> O valor lógico da proposição Q→(P∨Q) é sempre verdadeiro.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao43": {
        "texto": "<b>43</b> A proposição Q é equivalente à proposição “Se o processo foi relatado, então ele foi assinado”.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao44": {
        "texto": "Julgue os itens seguintes, relativos a lógica proposicional e a lógica de primeira ordem.<br><br><b>44</b> <b>Situação hipotética</b>: Os documentos A, B e C pertencem a João, Paulo e Artur, não necessariamente nessa ordem. Sabe-se que: se o documento A for arquivado, então o documento C será arquivado; o documento B não será arquivado; o documento pertencente a João será arquivado se, e somente se, o documento pertencente a Artur for arquivado; exatamente dois desses documentos não serão arquivados. <b>Assertiva</b>: Com base nessas informações, conclui-se que o documento C pertence a Paulo e será arquivado.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao45": {
        "texto": "<b>45</b> A negação da proposição “Todas as reuniões devem ser gravadas por mídias digitais” é corretamente expressa por “Nenhuma reunião deve ser gravada por mídias digitais”.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao46": {
        "texto": "O setor de gestão de pessoas de determinada empresa realiza regularmente a análise de pedidos de férias e de licenças dos seus funcionários. Os pedidos são feitos em processos, em que o funcionário solicita apenas férias, apenas licença ou ambos (férias e licença). Em determinado dia, 30 processos foram analisados, nos quais constavam 15 pedidos de férias e 23 pedidos de licenças.<br><br>Com base nessa situação hipotética, julgue os itens que se seguem.<br><br><b>46</b> A quantidade de processos analisados nesse dia que eram referentes apenas a pedido de férias é igual a 8.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao47": {
        "texto": "<b>47</b> Se todos os processos foram analisados individualmente nesse dia, então a probabilidade de um processo específico ter sido o primeiro a ser analisado é superior a 1/10.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      "questao48": {
        "texto": "<b>48</b> Se 2 desses 30 processos forem aleatoriamente selecionados para auditoria, então a quantidade de pares de processos possíveis será superior a 400.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao49": {
        "texto": "<b>49</b> Supondo-se que cada um dos 30 processos analisados nesse dia tenha uma quantidade diferente de páginas, que o processo com menor quantidade de páginas tenha 20 páginas e que metade dos processos tenha, cada um, mais de 50 páginas, conclui-se que mais de 1.100 páginas foram analisadas naquele dia.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "1"
      },
      "questao50": {
        "texto": "<b>50</b> Suponha que uma quantidade x de novos processos tenha sido enviada a esse setor para análise naquele dia; suponha, ainda, que, ao final do expediente, apenas a metade do total de processos, incluídos os novos, tenha sido relatada. Nessa situação, se a quantidade de processos relatados nesse dia tiver sido igual a 26, então x < 20.",
        "alternativas": {
          "1": "Certo",
          "2": "Errado."
        },
        "correta": "2"
      },
      }
    }
